package entity;

import main.GamePanel;
import main.KeyHandler;
import object.Antibodies;

import java.awt.*;

public class Player extends Entity {
    KeyHandler keyHandler;

    public Player(GamePanel gamePanel, KeyHandler keyHandler) {
        super(gamePanel);
        this.keyHandler = keyHandler;

        setDefValues();
        getPlayerImage();
        setDialogues();
    }

    public void setDefValues()  {
        x = (gamePanel.screenWidth - gamePanel.scaledTileSize) / 2 ;
        y = gamePanel.screenHeight - gamePanel.scaledTileSize;

        collisionArea = new Rectangle(24, 24, 16, 16);

        speed = 6;
        direction = "right";
        projectile = new Antibodies(gamePanel);
    }

    public void getPlayerImage() {
        side1 = getImage("/player/player1");
        side2 = getImage("/player/player2");
    }

    public void setDialogues() {
        dialogues[0] = "გამარჯობა!";
        dialogues[1] = "მე ვარ დახვეწილი იმუნური სისტემის რობოტი, რომლის დავალებაცაა\n" +
                        "გაანადგუროს ამ ორგანიზმში ყველაფერი მავნე.";
        dialogues[2] = "შენ შეგიძლია უბრალოდ დიმ დამიძახო.";
        dialogues[3] = "მე მჭირდება შენი დახმარება, რომ დავეხმარო ამ ორგანიზმს.";
        dialogues[4] = "კაია! ჩვენი პირველი დანიშნულების ადგილია ფილტვები.";

        dialogues[6] = "ესენი არიან ტუბერკულოზის ბაქტერიაბი.\n\n" +
                        "საზიზღრები არიან. ისინი იმალებიან მაკროფაგების შიგნით და\n" +
                        "მასპინძელ უჯრედში წლები უჩინრად ცხოვრობენ.\n\n" +
                        "შეიძლება გაგიჩდეს კითხვა თუ, რატომ არ გაუმკლავდა\n" +
                        "მათ იმუნური სისტემა?";
        dialogues[7] = "ყველაფერი ერთი მარტივი მიზეზის გამო.\n\n" +
                        "ამ ბაქტერიებს განსაკუთრებული უჯრედის კედელი აქვთ: სქელი და ცხიმოვანი\n" +
                        "მათ არ ეშინიათ მჟავების და არ იშლებიან მარტივად.\n\n" +
                        "ზუსტად ამის გამო მათ შეუძლიათ წლების განმავლობაშ შეუმჩნებლად ცხოვრება\n" +
                        "და ნებისმიერ მომენტიში გამოვლინება.";
        dialogues[8] = "ტუბერკულოზის ბაქტერიები არიან აერობები. მათ არ შეუძლიათ ჰაერის გარეშე\n" +
                        "ცხოვრება, ზუსტად ამიტომ ისინი ცხოვრობენ ფილტვებში, სადაც ჟანგბადი\n" +
                        "ყოველთვის არის.";
        dialogues[9] = "ორგანიზმშიც ისინი ჰაერის საშუალებით ხვდებიან. საიდანაც, შემდეგ,\n" +
                        "ფილტვებშ გადადიან.\n";
        dialogues[10] = "დავადების სიმპტომები კი უფრო შემაწუხებელია.\n" +
                        "ხველა, სისუსტე, დაბალი სიცხე, ღამით ოფლიანობა, მადის გაქრობა\n";
        dialogues[11] = "გვიანი სიმპტომები კი უფრო საშინელია.\n" +
                        "სისხლიანი ხველა, მკვეთრად წონაში დაკლება, ტკივილი გულმკერდის არეში\n" +
                        "ფილტვის ქსოვილის გაწყვეტა და ჰაერის უკმარისობა.\n";
        dialogues[12] = "ტუბერკულოზის თავიდან ასაცილებლად შეგიძლია ვაქცინა გაიკეთოთ, რომელიც.\n" +
                        "დაგიცავს მისი მძიმე ფორმებისგან.\n" +
                        "და თუ ადგემართა პრეპარატებით კურნალობა გრძელდაბა 6-24 თვემდე.";

        dialogues[14] = "ყოჩაღ მშვენიერი ნამუშევარია.\n" +
                        "შენ შეძელი ტუბერკულოზის ბაქტერიების განადგურება!!!";
        dialogues[15] = "ჩვენი საქმე ფილტვებში დამთავრებულია.";
        dialogues[16] = "ბზზზზზზზზ\n\n" +
                        "~ !@$%!@^!@$^#&#^!@$#! !@$%@1@!$! !@#$! !!!\n\n" +
                        "კაი გასაგებია ახლავე გავემართები მაქეთკენ!";
        dialogues[17] = "ახლა მითხრეს, რომ ეს ორგანიზმი ციტომეგალოვირუსითაც ყოფილა დაავადებული\n" +
                        "და ახლა, როდესაც ორგანიზმი დასუსტებულია მან გამოიჩინა თავი.";
        dialogues[18] = "ვირუსის კორდინატები ჩამიგდეს და მაჩვენებს, რომ ღვიძლში არის \n" +
                        "კონცენტრირებული.\n" +
                        "თუ გვინდა, რომ ამ ორგანიზმს დავეხმაროთ\n" +
                        "მაშინ სწრაფად უნდა დავიძვრად ღვიძლისკენ!";

        dialogues[20] = "აი ეს საძაგელი ვირუსებიც!";
        dialogues[21] = "ეს ვირუსი შედგება დნმ-ისგან, ცილოვანი კაპსიდისგან და ლიპიდური გარსისგან";
        dialogues[22] = "და როცა ორგანიზმში შედის იმალება და მხოლოდ იმუნური სისტემის\n" +
                        "დაქვეითებისას იჩენს თავის. მაგიტომ არ მომწონს ის!";
        dialogues[23] = "ეს ვირუსი შეიძლება მრავალი გზით მოხვდეს შენს ორგანიზმში, მაგალითად:\n" +
                        "ნერწყვით, სქესობრივი გზით, დედიდან ნაყოფში და სისხლის გადასხმითაც კი";
        dialogues[24] = "ადრეულ სტადიაზე ციტომეგალოვირუსი გამოიწვევს:\n" +
                        "მაღალ ტემპერატურას, დაღლილობას, ყელისა და კუნტების ტკივილს და\n" +
                        "ლიმფური კვანძების გადიდებას.";
        dialogues[25] = "გვიან სტადიაზე კი გამოიწვევს:\n" +
                        "სერიოზულ ფილტვების ანთებას, თვალის დაზიანებას, და ღვიძლის, ნაწლაბების\n" +
                        "ან ტვინის დაზიანებას.";
        dialogues[26] = "თანდაყოლის შემთხვევაში ეს ვირუსი გამოიწვევს:\n" +
                        "სმენის დაქვეითბას, გონებრივი განვითარების შეფერხებას, მიკროცეფალიას\n" +
                        "ან რუნცვებს.\n";
        dialogues[27] = "ციტომეგალოვირუსი აზიანებს ნეიტროფილებს, ეპითელიურ და ენდოთელურ \n" +
                        "უჯრედებს, კერძოდ, სისხლძარღვებს, ფილტვებს, ღვიძლს, თვალებს და \n" +
                        "ნერვულ ქსოვილებს.\n";
        dialogues[28] = "ციტომეგალოვირუსი აზიანებს ნეიტროფილებს, ეპითელიურ და ენდოთელურ \n" +
                        "უჯრედებს, კერძოდ, სისხლძარღვებს, ფილტვებს, ღვიძლს, თვალებს და \n" +
                        "ნერვულ ქსოვილებს.\n";
        dialogues[29] = "მისგან დაცვის გზები არის:\n" +
                        "ხელების ხშირად დაბანა, სქესობრივი აქტისას დაცვის გამოყენება და\n" +
                        "სისხლისა და ორგანოების შემოწმება დონაციამდე.\n";

        dialogues[31] = "კაი ნამუშევარია! ეხლა შეგვიძლია გავაგრძელოთ ჩვენი მისია, მაგრამ \n" +
                        "მაქამდე მინდა გაჩვენო, რომ ყველა მიკრობი არ არის ცუდი.";

        dialogues[33] = "ესენი არიან ლაქტობაქტერიები. ადამიანის მეგობრები.\n" +
                        "მათ აქვთ ერთუჯრედიანი სტრუქტურა, გრძელწვრილი ან ჩხირის ფორმის\n" +
                        "უჯრედები. მათ არ გააჩნიათ ბირთვი, მაგრამ აქვთ გენეტიკური მასალა დნმ-ი\n";
        dialogues[34] = "ბუნევრივად გხვდებიან ნაწავებში, ვაგინალურ მიკროფლორაში და პირში.\n" +
                        "ასევე შეიძლება შეგხვდენენ საკვებში და ფერმენტირებულ პროდუკტებში,\n" +
                        "როგორიცაა: იოგურტი, კეფირი, მაწონი და სხვა გემრიელობები!";
        dialogues[35] = "ლაქტობაქტერიები, მიუხედავათ იმისა რომ ბაქტერიაა, არ იწვევენ დაავადებას,\n" +
                        "პირიქით, ისინი გვიცავენ ჩვენ მავნე მიკრობებისგან და\n" +
                        "ბალანსში ინარჩუნებენ ნაწლავურ მიკროფლორას\n";
        dialogues[36] = "ისინი იცავენ ნაწლავის კედელს პათოგენური ბაქტერიების შეჭრისგან,\n" +
                        "ასტიმულირებენ იმუნურ უჯრედებს და ამუშავებენ საკვებს და ეხმარებიან\n" +
                        "სარგებლიანი ნივთიერებების შეწოვაში.";
        dialogues[37] = "რადგან ლაქტობაქტერიები გვეხმარებიან ჩვენ, საჭიროა მათი შენარჩუნება\n" +
                        "და გამრავლება.\n\n" +
                        "ეს შეიძლება მიაღწიო ჯანსაღი დიეტით და პრობიოტიკების მიღებით\n" +
                        "მაგალითად: იოგურტი, მაწონი და სხვა.";

        dialogues[39] = "ეს კი არის ცოფის ვირუსი.";
        dialogues[40] = "საშინელი არსებაა. მის გამო არაერთი ცოცხალი ორგანიზმი დაღუპულა.";
        dialogues[41] = "ის აგებულია რნმ-ისგან, გარსისგან და მისი ფორმა ტყვიას გავს, რის\n" +
                        "გამოც მისი შეჩნევა და იდენტიპიცირება მიკროსკოპით მარტივია.";
        dialogues[42] = "ორგანიზმში ის ხვდება ნერწყვით, როდესაც ინფიცირებული უკბენს მსხვეპლს\n" +
                        "(სისხლამდე). ორგანიზმშ მოხვედრის შემდეგ კი ნელ-ნელა გადაადგილდება\n" +
                        "ნერვულ ქსოვილებში, სანამ ტვინამდე არ მიაღწევს.";
        dialogues[43] = "ყველაზე ცუდი ამ ვირუსშ არის ის, რომ ის განიცდის ლატენტურ ფაზას, \n" +
                        "როდესაც უკვე ინფიცირებულ ადამიანს არ აქვს არანაირი სიმპტომი, მაგრამ\n" +
                        "მათი გამოჩენის შემდეგ უკვე გვიანია განკურნვა.";
        dialogues[44] = "მიუხედავად იმისა, რომ უმეტესად ის ორგანიზმში ხვდება ცხოველის ნერწყვის\n" +
                        "სისხლში ან ლორწოვანზე მოხვედრით.\n" +
                        "იშვიათად ის შეიძლება გადაედოს ორგანოს გადანერგვისას.";
        dialogues[45] = "ცოფის ადრეული სიმპტომებია: \n" +
                        "კბენის ადგილის ქავილი, სისუსტე, უხასიათობა, ტემპერატურის ზრდა, \n" +
                        "თავის ტკივილი";
        dialogues[46] = "გვიანი სიმპტომები კი იწყება ტვინის დაზიანების დაწყებისას.\n" +
                        "ესენი არიან: აგრესიულობა, წყლის შიში, კრუნჩხვები, სუნთქვის გაჩერება \n" +
                        "და სიკვდილი...";
        dialogues[47] = "ეს ვირუსი ძირითადად აზიანებს ნეირონებს, რაც იწვევს ცენტრალური\n" +
                        "ნერვული სისტემის ფუნქციების მოშლას.\n" +
                        "განსაკუთრებით ჰიპოთალამუსსა და ტვინის ტოტებს, რაც იწვევს აგრესიას,\n" +
                        "ჰიდროფობიასა და სუნთქვის დარღვევას";
        dialogues[49] = "ცოფის ორგანიზმში შეჭრის შემთხვევაში კი აუცილებელია მომენტალური რეაგირება\n" +
                        "და შრატის გაკეთება. წინააღმდეგ შემთხვევში მისი სიმპტომების გამოვლენის\n" +
                        "შემთხვევაში სიკვდილი თითქმის აურიდებელია.";

    }

    public void update() {
        if (keyHandler.leftPressed || keyHandler.rightPressed) {
            if (keyHandler.rightPressed) {
                direction = "right";
            } else {
                direction = "left";
            }

            /*
                CHECK COLLISION
             */
            collision = false;
            gamePanel.collisionChecker.checkTile(this);

            if (!collision) {
                switch (direction) {
                    case "left":
                        x -= speed;
                        break;
                    case "right":
                        x += speed;
                        break;
                }
            }

            spriteCounter++;

            if (spriteCounter > 12) {
                if (spriteNum == 1) {
                    spriteNum = 2;
                } else if (spriteNum == 2) {
                    spriteNum = 1;
                }
                spriteCounter = 0;
            }
        }
        if(keyHandler.shootKeyPressed && !projectile.isAlive) {
            projectile.set(x, y, "up", true, this);

            gamePanel.projectiles.add(projectile);
        }

        int nextDialogTime = gamePanel.fps * 20;
        time++;

        if(time > nextDialogTime) {
            gamePanel.player.speak();
            gamePanel.level++;
            time = 0;
        }
    }

    public void speak() {
        gamePanel.gameState = gamePanel.dialogState;

        if (dialogues[dialogueIndex] != null) {
            gamePanel.ui.currentDialog = dialogues[dialogueIndex];
            System.out.println(dialogueIndex);
            dialogueIndex++;
        } else {
            dialogueIndex++;
            gamePanel.gameState = gamePanel.playState;
            gamePanel.ui.currentDialog = dialogues[dialogueIndex];
        }
    }
}
